Revit 2024 API
BuiltInFailures.DuctFailures Class
 Failures about Duct.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class DuctFailures
Visual Basic
Public NotInheritable Class DuctFailures
Visual C++
public ref class DuctFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DuctFailures
See Also
BuiltInFailures.DuctFailures Members
Autodesk.Revit.DB Namespace